# PickBox Method

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
Selection..::..PickBox Method
Selection Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| PickBox(PickBoxStyle) | Invokes a general purpose two-click editor that lets the user to specify a rectangular area on the screen. |
| PickBox(PickBoxStyle, String) | Invokes a general purpose two-click editor that lets the user to specify a rectangular area on the screen. |

# See Also
Selection Class
Selection Members
Autodesk.Revit.UI.Selection Namespace